---
kind: type
id: T:Autodesk.Revit.DB.ReferencePoint
source: html/b4b9baeb-2ec5-a2e1-1420-37f593d36aa4.htm
---
# Autodesk.Revit.DB.ReferencePoint

A reference point in an Autodesk Revit family.

## Syntax (C#)
```csharp
public class ReferencePoint : Element
```

## Remarks
A ReferencePoint represents a point in space together
with a local coordinate system. ReferencePoints can be free, or
constrained to other elements in several ways. When the point is
constrained, the coordinate system is also constrained in certain
ways.